In [1]:
import pandas as pd
from datetime import datetime, timedelta

# Sample DataFrame creation
data = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 22, 35, 28],
    'Status': ['Active', 'Inactive', 'Active', 'Active', 'Inactive'],
    'Date': [datetime(2022, 1, 1) + timedelta(days=i) for i in range(5)]
}

df = pd.DataFrame(data)
df.head()

   ID     Name  Age    Status       Date
0   1    Alice   25    Active 2022-01-01
1   2      Bob   30  Inactive 2022-01-02
2   3  Charlie   22    Active 2022-01-03
3   4    David   35    Active 2022-01-04
4   5      Eva   28  Inactive 2022-01-05

In [2]:
# Save DataFrame to CSV file
df.to_csv('python_coding_challenge_data.csv', index=False)

In [4]:
# Read CSV data into a DataFrame
new_df = pd.read_csv("python_coding_challenge_data.csv")
new_df.head()

   ID     Name  Age    Status        Date
0   1    Alice   25    Active  2022-01-01
1   2      Bob   30  Inactive  2022-01-02
2   3  Charlie   22    Active  2022-01-03
3   4    David   35    Active  2022-01-04
4   5      Eva   28  Inactive  2022-01-05

In [5]:
# Filter Data using query
filtered_df = new_df.query('Age > 25')

# Display the filtered DataFrame
print("\nFiltered DataFrame:")
print(filtered_df)

Filtered DataFrame:
   ID   Name  Age    Status        Date
1   2    Bob   30  Inactive  2022-01-02
3   4  David   35    Active  2022-01-04
4   5    Eva   28  Inactive  2022-01-05

In [6]:
filtered_df = df.query('Age > 25 and Status == "Active"')
print(filtered_df)

   ID   Name  Age  Status       Date
3   4  David   35  Active 2022-01-04